Q1 Create a PandasSeries that contains the following data: 4,8,15,16,23 and 42. Then print the series

In [1]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2: Create a variable of listtype containing 10 elements in it, and apply pandas. Sries function on the variable print it.

In [3]:
data2 = ["jyoti",10,13,45,56,67]
series2= pd.Series(data2)
print(series2)

0    jyoti
1       10
2       13
3       45
4       56
5       67
dtype: object

Q3: Create a Pandas Dataframe that contains the following data

In [9]:
import pandas as pd
data3 = { "Name" : ["Alice","Bob","Claire"],
         "Age":[25,30,27],
         "Gender":["Female","Male","Female"]}
df= pd.DataFrame(data3)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4: What is DataFrame in pandas and how is it different from pandas.Series? Explain with example?

Ans:  DataFrame in pandas is like a table with rows and columns , similar to a spreadsheet. It's a 2-dimensional data structure that can hold different 
types of data. Where as a pandaseries is like a single column from a dataframe, with a labeled index.

Q5: What are some common functions you can use to manipulate data in a pandas Dataframe ? Can you give an example of when you might use one of these
functions?

Some of the common functions we can use to manipulate data in a pandas Dataframe.
1.head()
2.info()
3.describe()
4.drop()
5.groupby()

Q6: Which of the following is mutuable in nature Series, DataFrame, Panel?

Ans: Series and DataFrame are mutable in nature. They can be modified and updated after they are created.

Q7: Create a DataFrame using multiple series.

In [10]:
import pandas as pd
name = ["John", "Sam", "Nick"]
ps = pd.Series(name)
age = [23,24,25]
ps1 = pd.Series(age)
gender = ["Male", "Male", "Male"]
ps2 = pd.Series(gender)

In [11]:
data4 = { "Name":name,
         "Age":age,
         "Gender":gender}
df2 = pd.DataFrame(data4)

In [12]:
df2

   Name  Age Gender
0  John   23   Male
1   Sam   24   Male
2  Nick   25   Male

In [13]:
print(df2)

   Name  Age Gender
0  John   23   Male
1   Sam   24   Male
2  Nick   25   Male